app/Controllers/Api/EmployeeController.php

SELECT *
FROM `employees`
---
	public function listEmployee()
	{
		$emp = new EmployeeModel();

        //log_message('error', $e->getMessage());

		$response = [
			'status' => 200,
			"error" => false,
			'messages' => 'Employee list',
			'data' => $emp->findAll()
		];

SELECT *
FROM `employees`
WHERE `employees`.`id` = '1'
---
	public function showEmployee($emp_id)
	{
		$emp = new EmployeeModel();

		$data = $emp->find($emp_id);

SELECT *
FROM `employees`
WHERE `employees`.`id` = '3'
---

			$emp = new EmployeeModel();

			if ($emp->find($emp_id)) {